loadtest/results/pgbouncer-ab-instance-2.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 300 requests
Completed 600 requests
Completed 900 requests
Completed 1200 requests
Completed 1500 requests
Completed 1800 requests
Completed 2100 requests
Completed 2400 requests
Completed 2700 requests
Completed 3000 requests
Finished 3000 requests


Server Software:        
Server Hostname:        localhost
Server Port:            9102

Document Path:          /api/hikaricp-1/employees
Document Length:        468 bytes

Concurrency Level:      60
Time taken for tests:   12.614 seconds
Complete requests:      3000
Failed requests:        0
Keep-Alive requests:    0
Total transferred:      1719000 bytes
HTML transferred:       1404000 bytes
Requests per second:    237.82 [#/sec] (mean)
Time per request:       252.288 [ms] (mean)
Time per request:       4.205 [ms] (mean, across all concurrent requests)
Transfer rate:          133.08 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0       3
Processing:     5  250 212.7    188    2224
Waiting:        5  237 208.4    178    2224
Total:          5  250 212.7    188    2224

Percentage of the requests served within a certain time (ms)
  50%    188
  66%    260
  75%    312
  80%    360
  90%    499
  95%    616
  98%    840
  99%   1166
 100%   2224 (longest request)