loadtest/results/pgbouncer-ab-instance-4.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 300 requests
Completed 600 requests
Completed 900 requests
Completed 1200 requests
Completed 1500 requests
Completed 1800 requests
Completed 2100 requests
Completed 2400 requests
Completed 2700 requests
Completed 3000 requests
Finished 3000 requests


Server Software:        
Server Hostname:        localhost
Server Port:            9104

Document Path:          /api/hikaricp-1/employees
Document Length:        468 bytes

Concurrency Level:      60
Time taken for tests:   12.970 seconds
Complete requests:      3000
Failed requests:        0
Keep-Alive requests:    0
Total transferred:      1719000 bytes
HTML transferred:       1404000 bytes
Requests per second:    231.30 [#/sec] (mean)
Time per request:       259.406 [ms] (mean)
Time per request:       4.323 [ms] (mean, across all concurrent requests)
Transfer rate:          129.43 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.8      0       6
Processing:     5  257 267.7    157    1640
Waiting:        4  246 263.4    143    1639
Total:          5  257 267.8    157    1640

Percentage of the requests served within a certain time (ms)
  50%    157
  66%    250
  75%    336
  80%    400
  90%    656
  95%    891
  98%   1053
  99%   1147
 100%   1640 (longest request)