loadtest/results/pgbouncer-ab-instance-5.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 300 requests
Completed 600 requests
Completed 900 requests
Completed 1200 requests
Completed 1500 requests
Completed 1800 requests
Completed 2100 requests
Completed 2400 requests
Completed 2700 requests
Completed 3000 requests
Finished 3000 requests


Server Software:        
Server Hostname:        localhost
Server Port:            9105

Document Path:          /api/hikaricp-1/employees
Document Length:        468 bytes

Concurrency Level:      60
Time taken for tests:   12.392 seconds
Complete requests:      3000
Failed requests:        0
Keep-Alive requests:    0
Total transferred:      1719000 bytes
HTML transferred:       1404000 bytes
Requests per second:    242.10 [#/sec] (mean)
Time per request:       247.831 [ms] (mean)
Time per request:       4.131 [ms] (mean, across all concurrent requests)
Transfer rate:          135.47 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.7      0       6
Processing:    12  244 187.1    182    1571
Waiting:        9  234 187.9    169    1571
Total:         12  244 187.2    182    1571

Percentage of the requests served within a certain time (ms)
  50%    182
  66%    272
  75%    330
  80%    376
  90%    481
  95%    617
  98%    775
  99%    872
 100%   1571 (longest request)