loadtest/results/pgbouncer-ab-screenshot-1.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 3000 requests
Completed 6000 requests
Completed 9000 requests
Completed 12000 requests
Completed 15000 requests
Completed 18000 requests
Completed 21000 requests
Completed 24000 requests
Completed 27000 requests
Completed 30000 requests
Finished 30000 requests


Server Software:        
Server Hostname:        localhost
Server Port:            9101

Document Path:          /api/hikaricp-1/employees
Document Length:        468 bytes

Concurrency Level:      60
Time taken for tests:   56.316 seconds
Complete requests:      30000
Failed requests:        0
Keep-Alive requests:    0
Total transferred:      17190000 bytes
HTML transferred:       14040000 bytes
Requests per second:    532.70 [#/sec] (mean)
Time per request:       112.633 [ms] (mean)
Time per request:       1.877 [ms] (mean, across all concurrent requests)
Transfer rate:          298.09 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       2
Processing:     3  112 112.1     72    1657
Waiting:        3  108 110.9     68    1657
Total:          3  112 112.1     72    1657

Percentage of the requests served within a certain time (ms)
  50%     72
  66%    107
  75%    137
  80%    160
  90%    238
  95%    324
  98%    453
  99%    545
 100%   1657 (longest request)