loadtest/results/pgbouncer-ab-screenshot-2.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 3000 requests
Completed 6000 requests
Completed 9000 requests
Completed 12000 requests
Completed 15000 requests
Completed 18000 requests
Completed 21000 requests
Completed 24000 requests
Completed 27000 requests
Completed 30000 requests
Finished 30000 requests


Server Software:        
Server Hostname:        localhost
Server Port:            9102

Document Path:          /api/hikaricp-1/employees
Document Length:        468 bytes

Concurrency Level:      60
Time taken for tests:   57.774 seconds
Complete requests:      30000
Failed requests:        0
Keep-Alive requests:    0
Total transferred:      17190000 bytes
HTML transferred:       14040000 bytes
Requests per second:    519.26 [#/sec] (mean)
Time per request:       115.548 [ms] (mean)
Time per request:       1.926 [ms] (mean, across all concurrent requests)
Transfer rate:          290.57 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       2
Processing:     1  115 118.0     77    1621
Waiting:        1  111 116.6     74    1621
Total:          1  115 118.0     77    1621

Percentage of the requests served within a certain time (ms)
  50%     77
  66%    110
  75%    140
  80%    161
  90%    233
  95%    319
  98%    470
  99%    626
 100%   1621 (longest request)